src/main/resources/payloads/agd/searchByRegistrationNumber/request_rn_201305220000134.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header>
		<wsse:Security
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			SOAP-ENV:mustUnderstand="1">
			<wsse:UsernameToken
				xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
				wsu:Id="UsernameToken-13">
				<wsse:Username>DISC-VED</wsse:Username>
				<wsse:Password
					Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">089e8b$T#10000m</wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
		<TargetEnvironment xmlns="http://schemas.ppsr.gov.au/2011/04/services">Discovery</TargetEnvironment>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<ns4:SearchByRegistrationNumberRequestMessage
			xmlns:ns4="http://schemas.ppsr.gov.au/2011/04/services" 
			xmlns:ns2="http://schemas.ppsr.gov.au/2011/04/data"
			xmlns:ns3="http://schemas.microsoft.com/2003/10/Serialization/Arrays"
			xmlns:ns5="http://schemas.ppsr.gov.au/faults">
			<ns4:SearchByRegistrationNumberRequest>
				<ns2:CustomersRequestMessageId>140522-SN09O-00002</ns2:CustomersRequestMessageId>
				<ns2:CustomersUserDefinedFields />
				<ns2:SearchCriteria>
					<ns2:RegistrationNumber>201305220000134</ns2:RegistrationNumber>
				</ns2:SearchCriteria>
			</ns4:SearchByRegistrationNumberRequest>
		</ns4:SearchByRegistrationNumberRequestMessage>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>